{
  "updates": [
    {
      "version": "1.3.1",
      "date": "2019-11-21",
      "change": "Added Batch Wikipedia Heading to Snippet Processing via hashtag (#) and at sign (@) symbols. Items should be seprated by double whitespace. Individual Wikipedia headings can be processed with either symbols as well. Please take note of the differences as follows: The hashtag (#) symbol will include a link to the related Wikipedia article with the snippet for user convenience, and convert Wikipedia headings with parentheses into 'the' snippets on copy (e.g. 'Us (2019 film)' --> 'the 2019 film Us'). The at sign (@) symbol will convert Wikipedia headings with parentheses into 'the' snippets on copy, but will not include a link to the related Wikipedia article."
    },
    {
      "version": "1.3.0",
      "date": "2019-11-17",
      "change": "Added Snippets to allow users to enter, store, and quickly access commonly used text."
    },
    {
      "version": "1.2.6",
      "date": "2019-11-14",
      "change": "Sample input is now viewed as placeholder when input textarea is empty. App auto saves last known settings, inputted text."
    },
    {
      "version": "1.2.5",
      "date": "2019-11-12",
      "change": "Fixed text stripping algorithm to account for missing closing quotation following removed parenthesized text when remove parantehsized text mode is enabled. e.g. \"Try (Just a Little Bit Harder)\" becomes \"Try instead of \"Try\""
    },
    {
      "version": "1.2.4",
      "date": "2019-10-27",
      "change": "Added Changelog. Fixed text area spacing."
    },
    {
      "version": "1.2.3",
      "date": "2019-10-22",
      "change": "Fixed toggle label margin spacing. Added \"Nothing to Copy!\" user feedback when input is blank. Fixed stripping out whitespaces and dashes prior to word count. Fixed issue of not maintaining whitespace types (e.g. newline, tab) during handleStrip."
    },
    {
      "version": "1.2.2",
      "date": "2019-10-21",
      "change": "Added remove all parenthesis mode. Fixed user feedback in Dark Mode."
    },
    {
      "version": "1.2.1",
      "date": "2019-10-16",
      "change": "Fixed text stripping algorithm to account for rare references (e.g. [5]:35, [5]:35–36, [10]:400,418[11][12][13][14])."
    },
    {
      "version": "1.2.0",
      "date": "2019-10-13",
      "change": "Removed Easy Mode. Removed react-copy-to-clipboard third-party package. Added copy to clipboard function. Added dark mode."
    },
    {
      "version": "1.1.0",
      "date": "2019-10-11",
      "change": "Changed CSS to SCSS. Added Easy Mode (single box editing). Fixed word count algorithm to account for new line."
    },
    {
      "version": "1.0.5",
      "date": "2019-09-20",
      "change": "Fixed spacing issues on plaintext url stripping."
    },
    {
      "version": "1.0.4",
      "date": "2019-09-16",
      "change": "Fixed text stripping algorithm to strip out plain text converted hyperlink URLs."
    },
    {
      "version": "1.0.3",
      "date": "2019-09-15",
      "change": "Removed character count. Changed word count from text to circular progress bar."
    },
    {
      "version": "1.0.2",
      "date": "2019-09-14",
      "change": "Added word count."
    },
    {
      "version": "1.0.1",
      "date": "2019-09-13",
      "change": "Added user feedback when copying."
    },
    {
      "version": "1.0.0",
      "date": "2019-09-12",
      "change": "Created initial tool with React, SCSS"
    }
  ]
}
