{
  "updates": [
    {
      "version": "1.4.2",
      "date": "2020-08-19",
      "change": "Added snippet count."
    },
    {
      "version": "1.4.1",
      "date": "2020-08-09",
      "change": "Improved Wikipedia link to snippet conversion handling by removing # from Wikipeia URL on submit. URL encoded é and ' from Wikipedia links are now displayed correctly in snippets. Snippets will display full snippet value on hover. Presets will display full preset value or warn that no value has been saved to either $preset1 or $preset2 on hover."
    },
    {
      "version": "1.4.0",
      "date": "2020-04-16",
      "change": "Added Presets to allow users to save input single- and multi- line 'input' text via '$preset1' and '$preset2' commands"
    },
    {
      "version": "1.3.10",
      "date": "2020-04-10",
      "change": "Toggle between lowercase mode and normal input by clicking on the 'Reference Stripper' title."
    },
    {
      "version": "1.3.9",
      "date": "2020-03-06",
      "change": "Updated snippet sorting algorithm to check for lingering strikeout styling when copying text, e.g. -Jerry Garcia-. Updated snippets keys to fix issue of snippets not being removed immediately upon deletion."
    },
    {
      "version": "1.3.8",
      "date": "2020-02-18",
      "change": "Added Wikipedia link to snippet conversion on input."
    },
    {
      "version": "1.3.7",
      "date": "2020-02-14",
      "change": "Updated snippet sorting algorithm to check for unique values via side by side comparison rather than generating unique values, e.g. #Coolio  Coolio  Nas  Nas  Coolio  Coolio -> Coolio, Nas, Coolio (rather than Coolio, Nas). Note: Commas in this example separates snippets generated in output. This new sorting method allow users to keep track of snippet items in a chronological order where items may be revisited later on."
    },
    {
      "version": "1.3.6",
      "date": "2020-02-12",
      "change": "Fixed issue of users taken to wrong URL when Wikipedia header contain a question mark."
    },
    {
      "version": "1.3.5",
      "date": "2020-01-29",
      "change": "Fixed issue where 'output' text is recopied when revisiting tab with Reference Stripper on Safari browser."
    },
    {
      "version": "1.3.4",
      "date": "2020-01-12",
      "change": "Updated Wikipedia heading snippet copying functions for Wikipedia headings with parentheses, e.g. Us (2019 film), or commas, e.g. Charles V, Holy Roman Emperor. Clicking the grey box containing Wikipedia heading will result in a 1:1 copy (Charles V, Holy Roman Emperor -> Charles V, Holy Roman Emperor). Clicking the blue box with separated arrows will result in a reversed order copy with no comma or parentheses (Charles V, Holy Roman Emperor -> Holy Roman Emperor Charles V). Clicking the yellow box with crossed out parentheses and comma will result in a copified copy (Charles V, Holy Roman Emperor -> Charles V). Updated onSubmit function to prevent users from creating snippets containing no text."
    },
    {
      "version": "1.3.3",
      "date": "2019-12-21",
      "change": "Fixed minor styling issues on snippet labels and changelog button. Removed 'the' from converted Wikipedia headers on copy."
    },
    {
      "version": "1.3.2",
      "date": "2019-11-26",
      "change": "Added PropTypes. Broke ReferenceStripper further into components. Ran JavaScript syntax and logic error check. Fixed errors."
    },
    {
      "version": "1.3.1",
      "date": "2019-11-21",
      "change": "Added Batch Wikipedia Heading to Snippet Processing via hashtag (#) symbol at start of input. Each individual item to be made into a snippet should be separated by double whitespace (e.g double space). Note: On macOS, 'Add period after double-space' should be disabled to prevent issues via  Apple menu > ‘System Preferences’ > ‘Keyboard’ preference panel > ‘Text’ tab > uncheck ‘Add period with double-space’. Individual Wikipedia headings can be processed as well. Please take note of the following: The hashtag (#) symbol will include a link to the related Wikipedia article with the snippet, as well as and convert Wikipedia headings with parentheses into 'the' statements on copy ('Us (2019 film)' --> 'the 2019 film Us') for user convenience."
    },
    {
      "version": "1.3.0",
      "date": "2019-11-17",
      "change": "Added Snippets to allow users to enter, store, and quickly access commonly used text."
    },
    {
      "version": "1.2.6",
      "date": "2019-11-14",
      "change": "Sample input is now viewed as placeholder when input textarea is empty. App auto saves last known settings, inputted text."
    },
    {
      "version": "1.2.5",
      "date": "2019-11-12",
      "change": "Fixed text stripping algorithm to account for missing closing quotation after a parentheses when Remove All Parentheses Mode is enabled, e.g. \"Try (Just a Little Bit Harder)\" becomes \"Try instead of \"Try\"."
    },
    {
      "version": "1.2.4",
      "date": "2019-10-27",
      "change": "Added Changelog. Fixed text area spacing."
    },
    {
      "version": "1.2.3",
      "date": "2019-10-22",
      "change": "Fixed toggle label margin spacing. Added \"Nothing to Copy!\" user feedback when input is blank. Fixed stripping out whitespaces and dashes prior to word count. Fixed issue of not maintaining whitespace types, e.g. newline, tab, during handleStrip."
    },
    {
      "version": "1.2.2",
      "date": "2019-10-21",
      "change": "Added Remove All Parentheses Mode. Fixed user feedback in Dark Mode."
    },
    {
      "version": "1.2.1",
      "date": "2019-10-16",
      "change": "Fixed text stripping algorithm to account for rare references, e.g. [5]:35, [5]:35–36, [10]:400,418[11][12][13][14]."
    },
    {
      "version": "1.2.0",
      "date": "2019-10-13",
      "change": "Removed Easy Mode. Removed react-copy-to-clipboard third-party package. Added copy to clipboard function. Added Dark Mode."
    },
    {
      "version": "1.1.0",
      "date": "2019-10-11",
      "change": "Changed CSS to SCSS. Added Easy Mode (single box editing). Fixed word count algorithm to account for new line."
    },
    {
      "version": "1.0.5",
      "date": "2019-09-20",
      "change": "Fixed spacing issues on plaintext url stripping."
    },
    {
      "version": "1.0.4",
      "date": "2019-09-16",
      "change": "Fixed text stripping algorithm to strip out plain text converted hyperlink URLs."
    },
    {
      "version": "1.0.3",
      "date": "2019-09-15",
      "change": "Removed character count. Changed word count from text to circular progress bar."
    },
    {
      "version": "1.0.2",
      "date": "2019-09-14",
      "change": "Added word count."
    },
    {
      "version": "1.0.1",
      "date": "2019-09-13",
      "change": "Added user feedback when copying."
    },
    {
      "version": "1.0.0",
      "date": "2019-09-12",
      "change": "Created initial tool with React, CSS"
    }
  ]
}
